OpenFOAM/backwardFacingStepKasagi/Allrun
#!/bin/sh

./Allrun.pre
[ "$1" = "-m" ] && ./Allrun.monitor &
./Allrun.solve
./Allrun.post
./Allrun.plot

