OpenFOAM/backwardFacingStepKasagi/Allrun.solve
#!/bin/sh

simpleFoam > log 2>&1


